# Делу — время, потехе — час
# 
# Давайте передохнём от автоматизации 
# и сделаем что-то действительно интересное.
# 
# Формат ввода
# Одно натуральное число N
# 
# Формат вывода
# N строк с фразой: "Купи слона!"

n = int(input())

print(f'Купи слона!\n' * n)